app/views/progresses/_form.html.erb

SELECT "branches".* FROM "branches" WHERE "branches"."id" = 1 LIMIT 1
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 1 LIMIT 1
---
        <%if params[:order_id].blank?%>
          <%@orders = current_user.role.super_admin == true ? Order.all : Order.where(:branch_id => current_user.branch_id)%>