app/views/orders/_form.html.erb

SELECT "clients".* FROM "clients"
---
  <script>
  <%unless @order.client_id.blank?%>

SELECT "branches".* FROM "branches" WHERE "branches"."id" = 1 LIMIT 1
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 1 LIMIT 1
---
        <br />
        <%@branches = current_user.role.super_admin == true ? Branch.all : Branch.where(:id => current_user.branch_id)%>

SELECT "workshops".* FROM "workshops" WHERE "workshops"."branch_id" = 1
---
          <%= f.label :workshop_id %>
          <%= f.collection_select(:workshop_id, Workshop.where(:branch_id => current_user.branch_id), :id, :name, {:prompt => true}) %>

SELECT "statuses".* FROM "statuses" WHERE "statuses"."branch_id" = 1 ORDER BY hierarchy ASC
---
            <%else%>
              <%= f.collection_select(:status_id, Status.where(:branch_id => current_user.branch_id).order("hierarchy ASC"), :id, :name, {:prompt => false}) %>

SELECT SUM("parts"."cost") AS sum_id FROM "parts" INNER JOIN "serial_numbers" ON "parts"."id" = "serial_numbers"."part_id" INNER JOIN "order_serial_numbers" ON "serial_numbers"."id" = "order_serial_numbers"."serial_number_id" WHERE "order_serial_numbers"."order_id" = 2
---
            <% if controller.action_name == "edit" || controller.action_name == "update" %>
              <% total = "$" + "%.2f" % @order.parts.sum(:cost) %>

SELECT "order_client_needs".* FROM "order_client_needs" WHERE "order_client_needs"."order_id" = 1
---
            <% if controller.action_name == "edit" || controller.action_name == "update" %>
              <% total = "$" + "%.2f" % @order.client_needs.sum(:cost) %>

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", "1"]]
---
              <tr class="client-need-fields" style="height: 50px; border-bottom: 1px solid #ccc;">
                <td class="client-need-id" style="width: 80px; border-right: 1px solid #ccc;"><%#= order_client_need_form.object.order.id unless order_client_need_form.object.order.nil? %></td>

SELECT "order_serial_numbers".* FROM "order_serial_numbers" WHERE "order_serial_numbers"."order_id" = 1
---

              $.ajax({
                url: "/serial_numbers/serial_number_with_part",
                async: false,
                data: {part_name: part_name},
                dataType: "json",
                success: function(serial_number) {
                  $content.find(".hidden-serial-number-id").val(serial_number.id);
                  $content.find(".serial-number").html(serial_number.serial_number);
                  $content.find(".part-name").html(serial_number.part_name);
                  $content.find(".part-cost").html(parseFloat(serial_number.part_cost).toFixed(2));
                }
              });

SELECT "clients".* FROM "clients" WHERE "clients"."id" = 1 LIMIT 1
---

              $.ajax({
                url: "/client_needs/get_client_need_by_name",
                async: false,
                data: {client_need_name: client_need_name},
                dataType: "json",
                success: function(client_need) {
                  $content.find(".hidden-client-need-id").val(client_need.id);
                  $content.find(".client-need-id").html(client_need.id);
                  $content.find(".client-need-name").html(client_need.name);
                  $content.find(".client-need-cost").html(parseFloat(client_need.cost).toFixed(2));
                }
              });