app/views/orders/show.html.erb

SELECT "clients".* FROM "clients" WHERE "clients"."id" = 1 LIMIT 1
---
        <b><%=t'.country'%>:</b>
        <%= @order.client.country %>

SELECT "bills".* FROM "bills" WHERE "bills"."client_id" = 1 LIMIT 1
---
      <br>
      <%@bill = Bill.find_by_client_id(@order.client_id)%>

SELECT "workshops".* FROM "workshops" WHERE "workshops"."id" = 1 LIMIT 1
---
        <b>Country:</b>
        <%= @order.workshop.country %>

SELECT "parts".* FROM "parts" INNER JOIN "serial_numbers" ON "parts"."id" = "serial_numbers"."part_id" INNER JOIN "order_serial_numbers" ON "serial_numbers"."id" = "order_serial_numbers"."serial_number_id" WHERE "order_serial_numbers"."order_id" = 2
---

          <% @order.parts.each do |part| %>

SELECT "progresses".* FROM "progresses" WHERE "progresses"."order_id" = 2
---
          </tr>
          <% @order.progresses.each do |progress| %>