app/views/serial_numbers/_form.html.erb


  <% @parts = current_user.role.super_admin == true ? Part.all : Part.where(:branch_id => current_user.branch_id) %>
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 1 LIMIT 1

        <div class="controls">
    <%= f.collection_select(:part_id, Part.all, :id, :name, :prompt => true)%>
---
SELECT "parts".* FROM "parts"