app/controllers/bills_controller.rb

SELECT "bills".* FROM "bills" WHERE "bills"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "clients".* FROM "clients" WHERE "clients"."id" = 1 LIMIT 1
---
  def show
    if params[:autocomplete] == true
      @bill = Bill.find_by_client_id(params[:id])
    else
      @bill = Bill.find(params[:id])