app/controllers/branches_controller.rb

SELECT "branches".* FROM "branches" ORDER BY id DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "orders" WHERE (status_id != 3)
---
  def index
    @branches = Branch.order("id DESC").paginate(:page => params[:page])