app/controllers/client_needs_controller.rb

SELECT "branches".* FROM "branches" WHERE "branches"."id" = 1 LIMIT 1
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 1 LIMIT 1
SELECT COUNT(*) FROM "orders" WHERE (status_id != 3)
---
  def index
    @client_needs = current_user.role.super_admin == true ? ClientNeed.order("id DESC").paginate(:page => params[:page]) : ClientNeed.where(:branch_id => current_user.branch_id).order("id DESC").paginate(:page => params[:page])

SELECT "client_needs".* FROM "client_needs" WHERE "client_needs"."name" = 'El eqipo se apaga solo' LIMIT 1
---
  def get_client_need_by_name
    @client_need = ClientNeed.find_by_name(params[:client_need_name])