app/controllers/error_reports_controller.rb

SELECT "error_reports".* FROM "error_reports" ORDER BY id DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "error_reports"
SELECT COUNT(*) FROM "orders" WHERE (status_id != 3)
---
  def index
    #@error_reports = current_user.role.super_admin == true ? ErrorReport.order("id DESC").paginate(:page => params[:page]) : ErrorReport.where(:branch_id => current_user.branch_id).order("id DESC").paginate(:page => params[:page])
    #@all_error_reports = current_user.role.super_admin == true ? ErrorReport.all : ErrorReport.where(:branch_id => current_user.branch_id)

    @error_reports = ErrorReport.order("id DESC").paginate(:page => params[:page])

SELECT "error_reports".* FROM "error_reports" WHERE "error_reports"."id" = $1 LIMIT 1  [["id", "5"]]
---
  def show
    @error_report = ErrorReport.find(params[:id])