app/controllers/orders_controller.rb

SELECT "branches".* FROM "branches" WHERE "branches"."id" = 1 LIMIT 1
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 1 LIMIT 1
SELECT COUNT(*) FROM "orders" WHERE (status_id != 3)
---
  def index
    if @is_user
      @orders = current_user.role.super_admin == true ? Order.order("id DESC").paginate(:page => params[:page]) : Order.where(:branch_id => current_user.branch_id).order("id DESC").paginate(:page => params[:page])

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "clients".* FROM "clients" WHERE "clients"."id" = 1 LIMIT 1
SELECT "bills".* FROM "bills" WHERE "bills"."id" = 1 LIMIT 1
---
  def edit
    @order = Order.find(params[:id])
    @client = Client.find_by_id(@order.client_id)
    @bill = Bill.find_by_id((@order.bill_id))

INSERT INTO "orders" ("accessories", "bill_id", "branch_id", "client_id", "comments", "condition", "created_at", "delivery_date", "failure", "identifier", "product_type", "require_bill", "status_id", "total_due", "updated_at", "workshop_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"
SELECT "parts".* FROM "parts" INNER JOIN "serial_numbers" ON "parts"."id" = "serial_numbers"."part_id" INNER JOIN "order_serial_numbers" ON "serial_numbers"."id" = "order_serial_numbers"."serial_number_id" WHERE "order_serial_numbers"."order_id" = 2
SELECT "clients".* FROM "clients"
SELECT "order_client_needs".* FROM "order_client_needs" WHERE "order_client_needs"."order_id" IS NULL AND "order_client_needs"."id" IN (0, 3)
---
  def create
    #qwe
    sns = params[:order][:serial_numbers_attributes] || {}
    params[:order].delete(:serial_numbers_attributes)
    @order = Order.new(params[:order])
    @order.editing = false
    @product = @order.product_type.downcase.pluralize
    respond_to do |format|
      if @order.save
        sns.each do |sn|
          OrderSerialNumbers.create(order_id: @order.id, serial_number_id: sn[:id])
        end
        total_due = 0
        @order.parts.each do |part|
          total_due = part.cost + total_due
        end
        @order.client_needs.each do |client_need|

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", "2"]]
SELECT "clients".* FROM "clients" WHERE "clients"."id" = 1 LIMIT 1
SELECT "bills".* FROM "bills" WHERE "bills"."id" = 1 LIMIT 1
SELECT "order_serial_numbers".* FROM "order_serial_numbers" WHERE "order_serial_numbers"."order_id" = 1
SELECT "parts".* FROM "parts" INNER JOIN "serial_numbers" ON "parts"."id" = "serial_numbers"."part_id" INNER JOIN "order_serial_numbers" ON "serial_numbers"."id" = "order_serial_numbers"."serial_number_id" WHERE "order_serial_numbers"."order_id" = 2
SELECT "order_client_needs".* FROM "order_client_needs" WHERE "order_client_needs"."order_id" = 1
INSERT INTO "progresses" ("branch_id", "created_at", "full_description", "order_id", "short_description", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def update
    @order = Order.find(params[:id])
    sns = params[:order][:serial_numbers_attributes] || {}
    @order.editing = true
    @client = Client.find_by_id(@order.client_id)
    @bill = Bill.find_by_id((@order.bill_id))
    @render = "#{@order.product_type.downcase}_fields"
    @product = @order.product_type.downcase.pluralize
    respond_to do |format|
      if @order.update_attributes(params[:order])
        sns.each do |sn|
          if sn[:_destroy] == "true"
            OrderSerialNumbers.find_by_order_id_and_serial_number_id(@order.id, sn[:id]).destroy
          else
            OrderSerialNumbers.create(order_id: @order.id, serial_number_id: sn[:id])
          end
        end
        total_due = 0
        @order.parts.each do |part|
          total_due = part.cost + total_due
        end
        @order.client_needs.each do |client_need|
          total_due = client_need.cost + total_due
        end
        @order.update_attribute(:total_due, total_due)
        Progress.create(:short_description => @order.short_description, :full_description => @order.full_description, :user_id => current_user.id, :order_id => @order.id, :branch_id => @order.branch_id)

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", "2"]]
---
  def destroy
    @order = Order.find(params[:id])

SELECT "parts".* FROM "parts" WHERE (UPPER(name) LIKE UPPER('%Co%') and branch_id = 1)
---
  def autocomplete_part_name
    parts = Part.where("UPPER(name) LIKE UPPER(?)  and branch_id = #{current_user.branch_id}", "%#{params[:term]}%")

SELECT "serial_numbers".* FROM "serial_numbers" INNER JOIN parts p ON serial_numbers.part_id = p.id WHERE (branch_id = 1)
SELECT "parts".* FROM "parts" WHERE "parts"."id" = 5 LIMIT 1
---
  def autocomplete_serial_number
    serial_numbers = SerialNumber.joins("INNER JOIN parts p ON serial_numbers.part_id = p.id").where("branch_id = ?", current_user.branch_id).select { |s| /#{params[:term]}/i =~ "(#{s.serial_number}) #{s.part.name}" }
    json = serial_numbers.collect do |serial_number|

SELECT "client_needs".* FROM "client_needs" WHERE (UPPER(name) LIKE UPPER('%Re%') and branch_id = 1)
---
  def autocomplete_client_need_name
    client_needs = ClientNeed.where("UPPER(name) LIKE UPPER(?)  and branch_id = #{current_user.branch_id}", "%#{params[:term]}%")

SELECT "cellphones".* FROM "cellphones" WHERE ((UPPER(model) LIKE UPPER('%qweqwe%') or UPPER(brand) LIKE UPPER('%qweqwe%') or UPPER(color) LIKE UPPER('%qweqwe%') or UPPER(ope_system) LIKE UPPER('%qweqwe%'))and branch_id = 1)
---
  def autocomplete_cellphone_model
    cellphones = Cellphone.where("(UPPER(model) LIKE UPPER(?) or UPPER(brand) LIKE UPPER(?) or UPPER(color) LIKE UPPER(?) or UPPER(ope_system) LIKE UPPER(?))and branch_id = #{current_user.branch_id}", "%#{params[:term].strip}%", "%#{params[:term].strip}%", "%#{params[:term].strip}%", "%#{params[:term].strip}%")