app/controllers/parts_controller.rb

SELECT "branches".* FROM "branches" WHERE "branches"."id" = 1 LIMIT 1
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 1 LIMIT 1
SELECT COUNT(*) FROM "orders" WHERE (status_id != 3)
---
  def index
    @parts = current_user.role.super_admin == true ? Part.order("id DESC").paginate(:page => params[:page]) : Part.where(:branch_id => current_user.branch_id).order("id DESC").paginate(:page => params[:page])