app/controllers/serial_numbers_controller.rb

  def index
    @serial_numbers = SerialNumber.all
---
SELECT "serial_numbers".* FROM "serial_numbers"

  def edit
    @serial_number = SerialNumber.find(params[:id])
---
SELECT "serial_numbers".* FROM "serial_numbers" WHERE "serial_numbers"."id" = $1 LIMIT 1  [["id", "1"]]

  def serial_number_with_part
    @serial_number = SerialNumber.joins("INNER JOIN parts p ON serial_numbers.part_id = p.id").select { |s| params[:part_name] == "(#{s.serial_number}) #{s.part.name}" } || {}
    unless @serial_number.blank?
---
SELECT "serial_numbers".* FROM "serial_numbers" INNER JOIN parts p ON serial_numbers.part_id = p.id
SELECT "parts".* FROM "parts" WHERE "parts"."name" = 'Cargador para iPhone' LIMIT 1
SELECT "serial_numbers".* FROM "serial_numbers" WHERE "serial_numbers"."serial_number" IS NULL LIMIT 1