app/controllers/users_controller.rb

  def index
    @users = current_user.role.super_admin == true ? User.order("id DESC").paginate(:page => params[:page]) : User.where("branch_id = #{current_user.branch_id} and id != 1").order("id DESC").paginate(:page => params[:page])
---
SELECT "branches".* FROM "branches" WHERE "branches"."id" = 1 LIMIT 1
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT COUNT(*) FROM "orders" WHERE (status_id != 3)